Project/Toir/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СпособыСогласованияДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Упр)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСогласования</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ПроводитьАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замещающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОповещаемыеЛица</name>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещаемоеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_НастройкиСтатусовСогласованияДокументов/торо_НастройкиСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НастройкиСтатусовСогласованияДокументов</name>
  <resources>
    <name>Начальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованиеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонСообщенияЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПодборах</name>
    <comment>Не выводить ремонтные работы в форме подбора для документов, имеющих соответствующий статус</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПометкуНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеОтображатьВСпискеЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ПроводитьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_РазрешеноСоздаватьПодчиненные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ТребуетсяКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_МатрицаПереходаСтатусовДокументов/торо_МатрицаПереходаСтатусовДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МатрицаПереходаСтатусовДокументов</name>
  <attributes>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтатусаПерехода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СледующийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_СпособыСогласованияДокументов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаДляМатрицы = ?(ЗначениеЗаполнено(Параметры.ЗначениеКопирования), Параметры.ЗначениеКопирования, Объект.Ссылка);
	ЗаполнитьМатрицуПерехода(СсылкаДляМатрицы);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.торо_НастройкиСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СпособСогласования.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого Стр Из МатрицаПерехода Цикл
		Стр.НомерСтатуса = МатрицаПерехода.Индекс(Стр);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
	   НоваяЗапись.Статус = Стр.ТекущийСтатус;
		НоваяЗапись.СпособСогласования = Объект.Ссылка;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Для каждого Нсп Из СтатусыПерехода Цикл
		Нсп.НомерСтатусаПерехода = СтатусыПерехода.Индекс(Нсп);
	КонецЦикла;
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МатрицаПерехода.ТекущийСтатус КАК ТекущийСтатус,
	|	МатрицаПерехода.НомерСтатуса КАК НомерСтатуса
	|ПОМЕСТИТЬ втМатрицаПерехода
	|ИЗ
	|	&МатрицаПерехода КАК МатрицаПерехода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыПерехода.ТекущийСтатус КАК ТекущийСтатус,
	|	СтатусыПерехода.НовыйСтатус КАК НовыйСтатус,
	|	СтатусыПерехода.НомерСтатусаПерехода КАК НомерСтатусаПерехода
	|ПОМЕСТИТЬ втСтатусыПерехода
	|ИЗ
	|	&СтатусыПерехода КАК СтатусыПерехода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СпособСогласования КАК СпособСогласования,
	|	втМатрицаПерехода.ТекущийСтатус КАК ТекущийСтатус,
	|	втСтатусыПерехода.НовыйСтатус КАК СледующийСтатус,
	|	втМатрицаПерехода.НомерСтатуса КАК НомерСтатуса,
	|	втСтатусыПерехода.НомерСтатусаПерехода КАК НомерСтатусаПерехода
	|ИЗ
	|	втМатрицаПерехода КАК втМатрицаПерехода
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтатусыПерехода КАК втСтатусыПерехода
	|		ПО втМатрицаПерехода.ТекущийСтатус = втСтатусыПерехода.ТекущийСтатус";
	
	Запрос.УстановитьПараметр("СпособСогласования", Объект.Ссылка);
	Запрос.УстановитьПараметр("МатрицаПерехода"   , МатрицаПерехода.Выгрузить());
	Запрос.УстановитьПараметр("СтатусыПерехода"   , СтатусыПерехода.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.торо_МатрицаПереходаСтатусовДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СпособСогласования.Установить(Объект.Ссылка);
	НаборЗаписей.Загрузить(РезультатЗапроса);
	НаборЗаписей.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Выборка Из МатрицаПерехода Цикл
		
		Если Выборка.Начальный Тогда
			// Для начального статуса нужны согласующие, только если в него есть переходы. 
			ПереходыВНачальный = СтатусыПерехода.НайтиСтроки(Новый Структура("НовыйСтатус",Выборка.ТекущийСтатус)); 
			Если ПереходыВНачальный.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ПорядокСогласования.НайтиСтроки(Новый Структура("ТекущийСтатус",Выборка.ТекущийСтатус)).Количество() < 1 Тогда
			
			ШаблонСообщения = НСтр("es='¡Para el estatus ""%1"" no es dado ni uno ß«ú½áßÒ¯Ú¡¿®!';ru='Для статуса ""%1"" не задан ни один согласующий!';en='For status ""%1"" not a single matching has been set!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ТекущийСтатус);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивСостоянийСПроведением = МатрицаПерехода.НайтиСтроки(Новый Структура("ПроводитьДокумент", Истина));
	
	Для Каждого Выборка Из МассивСостоянийСПроведением Цикл
		
		СледующиеСтатусы = СтатусыПерехода.НайтиСтроки(Новый Структура("ТекущийСтатус", Выборка.ТекущийСтатус));
		Для каждого СледующийСтатус из СледующиеСтатусы Цикл
			СтрокаСледующегоСтатуса = МатрицаПерехода.НайтиСтроки(Новый Структура("ТекущийСтатус", СледующийСтатус.НовыйСтатус));
			Если СтрокаСледующегоСтатуса.Количество() > 0 
				И СтрокаСледующегоСтатуса[0].ПроводитьДокумент = Ложь	Тогда
				ШаблонСообщения = НСтр("es='El estatus ""%1"" que prohíbe a la realización, va después del estatus ""%2"" que permite a la realización.';ru='Статус ""%1"", запрещающий проведение, идет после статуса ""%2"", разрешающего проведение.';en='The status ""%1"" prohibiting the conduct goes after the status ""%2"" authorizing the conduct.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СледующийСтатус.НовыйСтатус, Выборка.ТекущийСтатус);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	
    Если Отказ Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La anotación no es cumplida!';ru='Запись не выполнена!';en='Writing failed!'"), 60);
		Возврат;
	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещаемыеЛица

&НаКлиенте
Процедура ОповещаемыеЛицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПередНачаломДобавления(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ОповещаемыеЛицаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ОтменаРедактирования И Элемент.ТекущиеДанные <> Неопределено 
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОповещаемоеЛицо) Тогда
		
		ТекстСообщения = НСтр("es='¡No es rellenada la persona informada!';ru='Не заполнено оповещаемое лицо!';en='Notified person is not filled!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЕсли;
	
	ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатрицаПерехода

&НаКлиенте
Процедура МатрицаПереходаПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда	
		
		УстановитьОтборыВСвязанныхТЧ(ТекущаяСтрока);
		
		// доступность статусов перехода
		Элементы.СтатусыПерехода.Доступность = Не ТекущаяСтрока.СогласованиеЗавершено ИЛИ ТекущаяСтрока.РазрешитьПометкуНаУдаление;
		
		ПорядокСогласованияПриАктивизацииСтроки(Элементы.ПорядокСогласования);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПереходаПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;	
	
	СтатусыДляУдаления = СтатусыПерехода.НайтиСтроки(Новый Структура("НовыйСтатус", ТекДанные.ТекущийСтатус));
	Если СтатусыДляУдаления.Количество() > 0 Тогда
		Для каждого ТекСтрока Из СтатусыДляУдаления Цикл 
			СтатусыПерехода.Удалить(ТекСтрока);
		КонецЦикла;			
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура МатрицаПереходаНачальныйПриИзменении(Элемент)
	
	// доступность согласующих и замещающих
	ТекущаяСтрокаСтатусов = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если ТекущаяСтрокаСтатусов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрокаСтатусов.Начальный Тогда
		
		МассивСтрок = Объект.ПорядокСогласования.НайтиСтроки(Новый Структура("ТекущийСтатус", ТекущаяСтрокаСтатусов.ТекущийСтатус));
		ПоказатьВопрос(Новый ОписаниеОповещения("МатрицаПереходаНачальныйПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("МассивСтрок, ТекущаяСтрокаСтатусов", МассивСтрок, ТекущаяСтрокаСтатусов)), НСтр("es='A la instalación del indicio del estatus inicial del documento, los datos vinculados a este estatus serán limpiados. ¿Continuar?';ru='При установке признака начального статуса документа, данные, связанные с этим статусом будут очищены. Продолжить?';en='When setting the sign of the initial status of the document, the data associated with this status will be cleared. Continue?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		
	Иначе
		
		ТекущаяСтрокаСтатусов.Начальный = Не ТекущаяСтрокаСтатусов.Начальный;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПереходаНачальныйПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	ТекущаяСтрокаСтатусов = ДополнительныеПараметры.ТекущаяСтрокаСтатусов;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Для Каждого Строка Из МассивСтрок Цикл
			
			МассвивЗамещающих = Объект.Замещающие.НайтиСтроки(Новый Структура("Пользователь",Строка.Пользователь));
			
			Если МассвивЗамещающих.Количество() > 0 Тогда
				Для Каждого СтрокаЗамещающих Из МассвивЗамещающих Цикл 
					Объект.Замещающие.Удалить(СтрокаЗамещающих.НомерСтроки - 1);
				КонецЦикла;
			КонецЕсли;
			
			Объект.ПорядокСогласования.Удалить(Строка.НомерСтроки - 1);
			
		КонецЦикла;
		
		//Элементы.ПорядокСогласования.Доступность = Не ТекущаяСтрокаСтатусов.Начальный;
		//Элементы.Замещающие.Доступность          = Не ТекущаяСтрокаСтатусов.Начальный;
		
		ВсеНачальныеСтатусы = МатрицаПерехода.НайтиСтроки(Новый Структура("Начальный", Истина));
		РазрешенПереходТолькоВНачальный = МатрицаПерехода.НайтиСтроки(Новый Структура("СогласованиеЗавершено, РазрешитьПометкуНаУдаление", Истина, Истина));
		РазрешенПереходТолькоВНачальныйМассив = Новый Массив;
		Для каждого Строка из РазрешенПереходТолькоВНачальный Цикл
			РазрешенПереходТолькоВНачальныйМассив.Добавить(Строка.ТекущийСтатус);
		КонецЦикла;
		
		Для Каждого Строка из ВсеНачальныеСтатусы Цикл
			Если Строка.ТекущийСтатус <> ТекущаяСтрокаСтатусов.ТекущийСтатус Тогда
				Строка.Начальный = Ложь;
				
				СтрокиСПереходомВНачальный = СтатусыПерехода.НайтиСтроки(Новый Структура("НовыйСтатус", Строка.ТекущийСтатус));
				Для каждого СтрокаПерехода из СтрокиСПереходомВНачальный Цикл
					Если РазрешенПереходТолькоВНачальныйМассив.Найти(СтрокаПерехода.ТекущийСтатус) <> Неопределено Тогда
						СтатусыПерехода.Удалить(СтрокаПерехода);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		ТекущаяСтрокаСтатусов.ЗапретитьРедактирование = Ложь;
		
	Иначе
		
		ТекущаяСтрокаСтатусов.Начальный = Не ТекущаяСтрокаСтатусов.Начальный;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатрицаПереходаСогласованиеЗавершеноПриИзменении(Элемент)
	
	ТекущаяСтрокаСтатусов = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если ТекущаяСтрокаСтатусов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если ТекущаяСтрокаСтатусов.СогласованиеЗавершено Тогда
		
		МассивСтрок = СтатусыПерехода.НайтиСтроки(Новый Структура("ТекущийСтатус", ТекущаяСтрокаСтатусов.ТекущийСтатус));
		ДополнительныеПараметры = Новый Структура("МассивСтрок, ТекущаяСтрокаСтатусов", МассивСтрок, ТекущаяСтрокаСтатусов);
		
		Если МассивСтрок.Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("МатрицаПереходаСогласованиеЗавершеноПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры), НСтр("es='A la instalación del indicio de la terminación de la coordinación el cambio ulterior de los estatus será imposible la parte tabular ""un Nuevo estatus"" será limpiada. ¿Continuar?';ru='При установке признака завершения согласования дальнейшая смена статусов будет невозможна и табличная часть ""Новый статус"" будет очищена. Продолжить?';en='When setting the sign of completion of coordination, further change of statuses will be impossible and the tabular part ""New status"" will be cleared. Continue?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		Иначе 
			МатрицаПереходаСогласованиеЗавершеноПриИзмененииЗавершение(Неопределено, ДополнительныеПараметры);
		КонецЕсли;
		
	Иначе
		
		Элементы.СтатусыПерехода.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПереходаСогласованиеЗавершеноПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	ТекущаяСтрокаСтатусов = ДополнительныеПараметры.ТекущаяСтрокаСтатусов;
	
	Если МассивСтрок.Количество() > 0 И РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		
		МассивНачальныхСтатусов = Новый Массив;
		Для Каждого Строка из МатрицаПерехода Цикл
			Если Строка.Начальный Тогда
				МассивНачальныхСтатусов.Добавить(Строка.ТекущийСтатус);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка Из МассивСтрок Цикл
			
			Если ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление 
				И МассивНачальныхСтатусов.Найти(Строка.НовыйСтатус) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтатусыПерехода.Удалить(Строка);
			
		КонецЦикла;
		
	ИначеЕсли  МассивСтрок.Количество() > 0 Тогда 
		
		ТекущаяСтрокаСтатусов.СогласованиеЗавершено = Не ТекущаяСтрокаСтатусов.СогласованиеЗавершено;
		
	КонецЕсли;
	
	Элементы.СтатусыПерехода.Доступность = Не ТекущаяСтрокаСтатусов.СогласованиеЗавершено ИЛИ ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление;

	Если ТекущаяСтрокаСтатусов.СогласованиеЗавершено И НЕ ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление Тогда
		ТекущаяСтрокаСтатусов.ПроводитьДокумент = Истина;
		ТекущаяСтрокаСтатусов.ЗапретитьРедактирование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПереходаЗапретитьРедактированиеПриИзменении(Элемент)
	
	ТекущаяСтрокаСтатусов = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если ТекущаяСтрокаСтатусов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрокаСтатусов.Начальный Тогда
		ТекущаяСтрокаСтатусов.ЗапретитьРедактирование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПереходаРазрешитьПометкуНаУдалениеПриИзменении(Элемент)
	
	ТекущаяСтрокаСтатусов = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если ТекущаяСтрокаСтатусов = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление Тогда
		Элементы.СтатусыПерехода.Доступность = Истина;
	Иначе
		
		Если ТекущаяСтрокаСтатусов.СогласованиеЗавершено Тогда
			
			МассивСтрок = СтатусыПерехода.НайтиСтроки(Новый Структура("ТекущийСтатус", ТекущаяСтрокаСтатусов.ТекущийСтатус));
			ДополнительныеПараметры = Новый Структура("МассивСтрок, ТекущаяСтрокаСтатусов", МассивСтрок, ТекущаяСтрокаСтатусов);
			
			Если МассивСтрок.Количество() > 0 Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("МатрицаПереходаРазрешитьПометкуНаУдалениеПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры), НСтр("es='El cambio ulterior de los estatus será imposible la parte tabular ""un Nuevo estatus"" será limpiada. ¿Continuar?';ru='Дальнейшая смена статусов будет невозможна и табличная часть ""Новый статус"" будет очищена. Продолжить?';en='Further change of statuses will be impossible and the tabular part ""New status"" will be cleared. Continue?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
			Иначе 
				МатрицаПереходаРазрешитьПометкуНаУдалениеПриИзмененииЗавершение(Неопределено, ДополнительныеПараметры);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПереходаРазрешитьПометкуНаУдалениеПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	ТекущаяСтрокаСтатусов = ДополнительныеПараметры.ТекущаяСтрокаСтатусов;
	
	Если МассивСтрок.Количество() > 0 И РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		
		Для Каждого Строка Из МассивСтрок Цикл
			СтатусыПерехода.Удалить(Строка);
		КонецЦикла;
		
	ИначеЕсли  МассивСтрок.Количество() > 0 Тогда 
		
		ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление = Не ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление;
		
	КонецЕсли;
	
	Элементы.СтатусыПерехода.Доступность = НЕ ТекущаяСтрокаСтатусов.СогласованиеЗавершено ИЛИ ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление;

	Если ТекущаяСтрокаСтатусов.СогласованиеЗавершено И НЕ ТекущаяСтрокаСтатусов.РазрешитьПометкуНаУдаление Тогда
		ТекущаяСтрокаСтатусов.ПроводитьДокумент = Истина;
		ТекущаяСтрокаСтатусов.ЗапретитьРедактирование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПорядокСогласования
&НаКлиенте
Процедура ПорядокСогласованияПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ТекСтатус = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если ТекСтатус <> Неопределено Тогда
		ТекСтатус = ТекСтатус.ТекущийСтатус;
	Иначе
		ТекСтатус = "------------";
	КонецЕсли;
		
	Если ТекущаяСтрока <> Неопределено Тогда
		
		// Отбор в новых Замещающих
		Элементы.Замещающие.ОтборСтрок = Новый ФиксированнаяСтруктура("Пользователь, ТекущийСтатус", ТекущаяСтрока.Пользователь, ТекСтатус);
	Иначе 
		
		Элементы.Замещающие.ОтборСтрок = Новый ФиксированнаяСтруктура("Пользователь, ТекущийСтатус", "------------", ТекСтатус);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСогласованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Не (НоваяСтрока И ОтменаРедактирования) И Не ЗначениеЗаполнено(ТекДанные.Пользователь) Тогда
			ТекстСообщения = НСтр("es='ß«ú½áßÒ¯Ú¡¿®!';ru='Не выбран согласующий!';en='No matching!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования);
	
	Если НЕ ОтменаРедактирования Тогда
		МассивСтрок = Объект.ПорядокСогласования.НайтиСтроки(Новый Структура("Пользователь, ТекущийСтатус", ТекДанные.Пользователь, ТекДанные.ТекущийСтатус));
		Если МассивСтрок.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("es='¡El usuario %1 es añadido ya en la lista ß«ú½áßÒ¯Ú¡¿Õ!';ru='Пользователь %1 уже добавлен в список согласующих!';en='User %1 has already been added to the matching list!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Пользователь);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСогласованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПередНачаломДобавления(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСогласованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено И Элементы.Замещающие.ОтборСтрок.Свойство("Пользователь") И ТекДанные.Пользователь <> Элементы.Замещающие.ОтборСтрок.Пользователь Тогда
			ТекущийОтбор = Новый Структура;
			Для каждого КлючИЗначение из Элементы.Замещающие.ОтборСтрок Цикл
				ТекущийОтбор.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
			
			НайденныеСтроки = Объект.Замещающие.НайтиСтроки(ТекущийОтбор);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.Пользователь = ТекДанные.Пользователь;
			КонецЦикла;
			
			ТекущийОтбор.Пользователь = ТекДанные.Пользователь;
			Элементы.Замещающие.ОтборСтрок = Новый ФиксированнаяСтруктура(ТекущийОтбор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыПерехода

&НаКлиенте
Процедура СтатусыПереходаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда 
		
		ТекущаяСтрока = Элемент.ТекущиеДанные;
		
		Если ТекущаяСтрока <> Неопределено Тогда
			
			МассивСтрок = МатрицаПерехода.НайтиСтроки(Новый Структура("ТекущийСтатус",ТекущаяСтрока.НовыйСтатус));
			Если МассивСтрок.Количество() < 1 Тогда
				
				 нс = МатрицаПерехода.Добавить();
				 нс.ТекущийСтатус = ТекущаяСтрока.НовыйСтатус;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПереходаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПередНачаломДобавления(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПереходаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		ТекДанные = Элементы.СтатусыПерехода.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(ТекДанные.НовыйСтатус) Тогда
			ТекстСообщения = НСтр("es='del documento';ru='Не заполнен новый статус документа';en='New document status not filled'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе 
			МассивСтрок = МатрицаПерехода.НайтиСтроки(Новый Структура("Начальный", Истина));
			Если МассивСтрок.Количество() Тогда
				НачальныйСтатус = МассивСтрок[0].ТекущийСтатус;
				
				ТекущиеДанныеМатрицы = Элементы.МатрицаПерехода.ТекущиеДанные;
				Если ТекущиеДанныеМатрицы = Неопределено Тогда
					Возврат;
				КонецЕсли;
				
				Если ТекДанные.НовыйСтатус <> НачальныйСтатус И ТекущиеДанныеМатрицы.РазрешитьПометкуНаУдаление И ТекущиеДанныеМатрицы.СогласованиеЗавершено Тогда
					ТекстСообщения = НСтр("es='¡Del estatus que acaba es posible pasar solamente en inicial!';ru='Из завершающего статуса можно перейти только в начальный!';en='From the final status, you can only go to the initial one!'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗамещающие

&НаКлиенте
Процедура ЗамещающиеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Не (НоваяСтрока И ОтменаРедактирования) И Не ЗначениеЗаполнено(ТекДанные.Замещающий) Тогда
			ТекстСообщения = НСтр("es='¡No es escogido que sustituye!';ru='Не выбран замещающий!';en='No substitute selected!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования);
	
	ТекущаяСтрока = Элементы.ПорядокСогласования.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Элемент.ТекущиеДанные.Пользователь = ТекущаяСтрока.Пользователь;

	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		МассивСтрок = Объект.Замещающие.НайтиСтроки(Новый Структура("Замещающий, ТекущийСтатус, Пользователь", ТекДанные.Замещающий, ТекДанные.ТекущийСтатус, ТекДанные.Пользователь));
		Если МассивСтрок.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("es='¡El usuario %1 es añadido ya en la lista que sustituyen!';ru='Пользователь %1 уже добавлен в список замещающих!';en='User %1 has already been added to the replacement list!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Замещающий);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		Если ТекДанные.Пользователь = ТекДанные.Замещающий Тогда
			ШаблонСообщения = НСтр("es='El usuario %1 es indicado en la cualidad согласующего. ¡æ«ú½áßÒ¯Ú¡¿® y que sustituye no deben coincidir!';ru='Пользователь %1 указан в качестве согласующего. Согласующий и замещающий не должны совпадать!';en='User %1 is listed as a matching user. Matching and replacing must not match!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Замещающий);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамещающиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущаяСтрока = Элементы.ПорядокСогласования.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		ТекстСообщения = НСтр("es='Escojan al usuario, корого es necesario sustituir.';ru='Выберите пользователя, корого нужно заместить.';en='Select the user to be replaced.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещаемые

&НаКлиенте
Процедура ОповещаемыеЛицаОповещаемоеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОповещаемыеЛица.ТекущиеДанные;
	ТекущийСтатус = Элементы.МатрицаПерехода.ТекущиеДанные;
	
	Если Не ВыбранноеЗначение = Неопределено
		И Не ТекущиеДанные = Неопределено
		И Не ТекущийСтатус = Неопределено Тогда
		
		АдресЭП = ОбработкаВыбораОповещаемогоНаСервере(ВыбранноеЗначение);
		
		Если НЕ АдресЭП = Неопределено Тогда
			ТекущиеДанные.ОповещаемоеЛицо       = ВыбранноеЗначение;
			ТекущиеДанные.АдресЭлектроннойПочты = АдресЭП;
			ТекущиеДанные.ТекущийСтатус         = ТекущийСтатус.ТекущийСтатус;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьМатрицуПерехода(Ссылка)
	
	МатрицаПерехода.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НастройкиСтатусовСогласованияДокументов.Статус КАК ТекущийСтатус,
	|	торо_НастройкиСтатусовСогласованияДокументов.Начальный КАК Начальный,
	|	торо_НастройкиСтатусовСогласованияДокументов.СогласованиеЗавершено КАК СогласованиеЗавершено,
	|	торо_НастройкиСтатусовСогласованияДокументов.ПроводитьДокумент КАК ПроводитьДокумент,
	|	торо_НастройкиСтатусовСогласованияДокументов.ШаблонСообщенияЭлектроннойПочты КАК ШаблонСообщенияЭлектроннойПочты,
	|	торо_НастройкиСтатусовСогласованияДокументов.НеИспользоватьВПодборах КАК НеИспользоватьВПодборах,
	|	торо_НастройкиСтатусовСогласованияДокументов.ЗапретитьРедактирование КАК ЗапретитьРедактирование,
	|	торо_НастройкиСтатусовСогласованияДокументов.РазрешитьПометкуНаУдаление КАК РазрешитьПометкуНаУдаление,
	|	торо_НастройкиСтатусовСогласованияДокументов.НеОтображатьВСпискеЗадач КАК НеОтображатьВСпискеЗадач
	|ИЗ
	|	РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	|ГДЕ
	|	торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &СпособСогласования
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_НастройкиСтатусовСогласованияДокументов.НомерСтатуса";
	
	Запрос.УстановитьПараметр("СпособСогласования", Ссылка);
	
	ТЗМатрицаПерехода = Запрос.Выполнить().Выгрузить();
	МатрицаПерехода.Загрузить(ТЗМатрицаПерехода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус КАК ТекущийСтатус,
	|	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус КАК НовыйСтатус
	|ИЗ
	|	РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	|ГДЕ
	|	торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = &СпособСогласования
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_МатрицаПереходаСтатусовДокументов.НомерСтатуса,
	|	торо_МатрицаПереходаСтатусовДокументов.НомерСтатусаПерехода";
	
	Запрос.УстановитьПараметр("СпособСогласования", Ссылка);
	
	ВыборкаСтатусыПерехода = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСтатусыПерехода.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаСтатусыПерехода.НовыйСтатус) Тогда
			НоваяСтрока = СтатусыПерехода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтатусыПерехода);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыВСвязанныхТЧ(ТекущаяСтрока)
	
	Элементы.СтатусыПерехода.ОтборСтрок     = Новый ФиксированнаяСтруктура("ТекущийСтатус", ТекущаяСтрока.ТекущийСтатус);
	Элементы.ПорядокСогласования.ОтборСтрок = Новый ФиксированнаяСтруктура("ТекущийСтатус", ТекущаяСтрока.ТекущийСтатус);
	Элементы.ОповещаемыеЛица.ОтборСтрок     = Новый ФиксированнаяСтруктура("ТекущийСтатус", ТекущаяСтрока.ТекущийСтатус);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломДобавления(Отказ) 
	
	ТекущаяСтрокаСтатуса = Элементы.МатрицаПерехода.ТекущиеДанные;
	
	Если ТекущаяСтрокаСтатуса = Неопределено Тогда
		ТекстСообщения = НСтр("es='Es necesario сначало escoger el estatus de la coordinación.';ru='Необходимо сначало выбрать статус согласования.';en='Required to first select the approval status.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрокаСтатуса = Элементы.МатрицаПерехода.ТекущиеДанные;
	
	Если ТекущаяСтрокаСтатуса <> Неопределено Тогда
		
		Если НоваяСтрока И Не ОтменаРедактирования И Элемент.ТекущиеДанные <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.ТекущийСтатус = ТекущаяСтрокаСтатуса.ТекущийСтатус;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборыВСвязанныхТЧ(ТекущаяСтрокаСтатуса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработкаВыбораОповещаемогоНаСервере(Оповещаемый)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ФизическиеЛицаКонтактнаяИнформация.Представление
	               |ИЗ
	               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка
	               |	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	Запрос.УстановитьПараметр("Ссылка", Оповещаемый.ФизическоеЛицо);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Представление;
	Иначе
		ШаблонСообщения = НСтр("es='A persona física vinculada al empleado <%1> no es indicado ni una электроннной dirección de los correos.';ru='У физического лица, связанного с сотрудником <%1> не указано ни одного адреса электроннной почты.';en='The individual associated with employee <%1> does not have a single email address.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Оповещаемый);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат "";
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти
